package main.cn.cnm;

/*
_ooOoo_
o8888888o
88" . "88
(| -_- |)
O\ = /O
___/`---'\____
 .   ' \\| |// `.
        / \\||| : |||// \
 / _||||| -:- |||||- \
 | | \\\ - /// | |
        | \_| ''\---/'' | |
 \ .-\__ `-` ___/-. /
___`. .' /--.--\ `. . __
        ."" '< `.___\_<|>_/___.' >'"".
        | | : `- \`.;`\ _ /`;.`/ - ` : | |
 \ \ `-. \_ __\ /__ _/ .-` / /
 ======`-.____`-.___\_____/___.-`____.-'======
 `=---='
 .............................................
佛曰：bug泛滥，我已瘫痪！
*/

/**
 * @author lele
 * @version 1.0
 * @Description I/O是Input/Output的缩写， I/O技术是非常实用的技术， 用于处理设备之间的数据传输。 如读/写文件，网络通讯（服务器与客户端之间数据传输也是IO）等
 * java.io 包下提供了各种“流”类和接口，用以获取不同种类的数据，并通过标准的方法输入或输出数据
 * 输入和输出是针对程序（内存， 程序运行在内存中）来说的
 * 字节流：直接从数据源/目的地读取数据
 * 处理流：不直接连接数据源/目的地， 而是“连接”在已存在的流（节点流或处理流）之上， 通过对数据的处理为程序提供更为强大的读写功能
 * @Email 414955507@qq.com
 * @date 2019/10/14 22:55
 */
public class IODemo {
    public static void main(String[] args) {
        /*
         *  IO涉及40多个类， 都是从4个抽象基类派生出来的：
         *   输入流：InputStream（字节流）/ Reader（字符流）
         *   输出刘：OutputStream（字节流）/ Write（字符流）
         */
    }
}
